# PolymeshFacet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshFacet Constructor
PolymeshFacet Class See Also
---
Creates a PolymeshFacet with the supplied vertices.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public PolymeshFacet(
	int v1,
	int v2,
	int v3
)
```

Visual Basic
---
```text
Public Sub New ( _
	v1 As Integer, _
	v2 As Integer, _
	v3 As Integer _
)
```

Visual C++
---
```text
public:
PolymeshFacet(
	int v1,
	int v2,
	int v3
)
```

# ### Parameters
v1
    Type: System..::..Int32The first vertex.
v2
    Type: System..::..Int32The second vertex.
v3
    Type: System..::..Int32The third vertex.
# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace